# Найти расстояние между двумя точками пространства

#     Пример:
#
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21
print ('ВВведите координату точки  x1: ');
x1 = int(input ())
print ('ВВведите координату точки  y1: ');
y1 = int(input ())
print ('ВВведите координату точки  x2: ');
x2 = int(input ())
print ('ВВведите координату точки  y2: ');
y2 = int(input ())
import math
c = math.sqrt((pow(x2-x1, 2))+(pow(y2-y1, 2)))
k = round(c, 2)
print(k)
