# Написать программу получающую набор произведений чисел от 1 до N.
# Пример: пусть N = 4, тогда
# [ 1, 2, 6, 24 ]

print('Введите N ');
N = int(input())
sum_N = list(range(1, N+1))
f=1
for i in sum_N:
    print(f"{f}", end = ", ")
    f *= (i + 1)
