# 17.	Задать список из N элементов, заполненных числами из [-N, N].
# Найти произведение элементов на указанных позициях.
# Позиции хранятся в файле file.txt в одной строке одно число

N = int (input (print ('Введите целое число, последовательность которых будеть выводиться с отрицательного до положительного диапазона')))
a = N - N*2;
while(a<=N):
    print(f"{a} ")
    a+=1

