# 21.	Определить, позицию второго вхождения строки в списке либо сообщить, что её нет.
# Примеры
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1

arr=["123", "234", 123, "567"]
b=["123"]
print(arr, b)

if b[0] in arr:
    del arr[arr.index(b[0])]
try:
    index = arr.index(b[0])
except ValueError:
    index = -2
print(index+1)
