# 21.	Определить, позицию второго вхождения строки в списке либо сообщить, что её нет.
# Примеры
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1

# arr=["qwe", "asd", "zxc", "qwe", "ertqwe"]
# b=["qwe"]
# print(arr, b)
# if b[0] in arr:
#     del arr[arr.index(b[0])]  
# print(arr.index(b[0])+1)
